Revit 2022 API
AnalyticalModel.IsValidSelector Method
 Indicates if the input selector is valid for the Analytical Model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool IsValidSelector(
	AnalyticalModelSelector selector
)
Visual Basic
Public Function IsValidSelector ( _
	selector As AnalyticalModelSelector _
) As Boolean
Visual C++
public:
bool IsValidSelector(
	AnalyticalModelSelector^ selector
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalModelSelector
 Portion of the analytical model geometry.
Return Value
 True if selector is valid for this Analytical Model, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace